---
kind: enumMember
id: F:Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Undefined
enum: Autodesk.Revit.DB.RoutingPreferenceRuleGroupType
source: html/79896fd9-e90c-6561-3bc4-7cefd4692ae5.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.Undefined

The undefined group type, the default initial value.